performance/my-test.yml
config:
  target: https://esben-test.herokuapp.com
  payload:
    - path: "./users.csv"
      fields:
        - "username"
        - "password"
  phases:
    - duration: 30
      arrivalRate: 5
      name: "Warming up Heroku"
    - duration: 30
      arrivalRate: 5
      rampTo: 20
      name: "Ramp up the load"
    - duration: 100
      arrivalRate: 20
      name: "Smash it"
  ensure:
    p95: 500
    maxErrorRate: 20
scenarios:
  - flow:
      - get:
          url: "/"
          headers:
            x-user: "{{ username }}"
            x-password: "{{ password }}"
      - get:
          url: "/users"
          headers:
            x-user: "{{ username }}"
            x-password: "{{ password }}"