performance/my-test.yml
config:
  target: https://esben-test.herokuapp.com
  payload:
    - path: "./users.csv"
      fields:
        - "username"
        - "password"
  phases:
    - duration: 30
      arrivalRate: 10
  ensure:
    p95: 500
scenarios:
  - flow:
      - get:
          url: "/"
          headers:
            x-user: "{{ username }}"
            x-password: "{{ password }}"
      - get:
          url: "/users"
          headers:
            x-user: "{{ username }}"
            x-password: "{{ password }}"